-- ------------------------------------------------------------------------
-- 任务系统主框架脚本
-- 服务器开启成功后 Main.lua 会自动加载此脚本
-- ------------------------------------------------------------------------

-- ------------------------------------------------------------------------
-- 描述：交互数据加载成功后，初始化完后Main.lua会自动调用该函数
--  所有模块都需从这里开始初始化本模块相应部分
-- ------------------------------------------------------------------------
function TaskMain_OnLogin(lActorID)
	-- 启动运镖任务
	--BodyGuard_GenTaskQueue(lActorID)	
end

-- ------------------------------------------------------------------------
-- 描述：每个玩家退出场景时会自动调用这个函数
-- 每个模块都应该在这里结束, 并清理完自己模块的相应垃圾
-- ------------------------------------------------------------------------
function TaskMain_OnLogout(lActorID)
end

-- ------------------------------------------------------------------------
-- 描述：每个玩家切换地图后会自动调用此函数
-- ------------------------------------------------------------------------
function TaskMain_OnLoginMap(lActorID)
	--运镖任务的地图切换后的处理框架
	--LoopTaskBodyGuard_SwitchMap(lActorID)
end

-- ------------------------------------------------------------------------
-- 描述：每个玩家切换地图前框架会自动调用此函数
-- ------------------------------------------------------------------------
function TaskMain_OnLogoutMap(lActorID)
	--运镖任务的地图切换前的处理框架
	--LoopTaskBodyGuard_SWPrevMap(lActorID)
end

-- ------------------------------------------------------------------------
-- 描述：每个玩家升级时会自动调用此函数
-- ------------------------------------------------------------------------
function TaskMain_OnUpgrade(lActorID)
	-- 快递任务
	--BodyGuard_OnUpgrade(lActorID)
end

-- ------------------------------------------------------------------------
-- 描述：每个玩家升级前会自动调用此函数判断是否允许升级
-- 1=是, 0=否
-- ------------------------------------------------------------------------
function TaskMain_OnLevelUp(lActorID,nExploitL)
	if 0==LoopTaskBastion_OnLevelUp(lActorID,nExploitL) then
		return 0
	end
	return 1
end

-- ------------------------------------------------------------------------
-- 在这里填写本模块需要在装载的脚本文件
-- ------------------------------------------------------------------------
--任务脚本加载
require 'Scp\\LUA\\Task\\Task.lua'

-- End File!!!