-- --------
-- 任务模板
-- --------

-- -------------------------------
-- 玩家选择本任务标题后触发此函数
-- -------------------------------
function Template_Title()
	local lType = API_RequestGetNumber(1)	-- 1: 属于可完成任务; 2: 属于可接受任务;

	-- 在这里生成任务对话
end

-- -----------------------
-- 玩家可接受本任务的条件
-- -----------------------
function Template_CanAccept(lActorID, lNPCID)
	-- 返回0表示不可以接受, 返回1表示可以接受
end

-- -----------------------
-- 玩家可完成本任务的条件
-- -----------------------
function Template_CanFinish(lActorID, lNPCID)
	-- 返回0表示不可以接受, 返回1表示可以完成
end

-- -------------------------------------------------------------------------
-- 玩家准备放弃本任务的条件
-- -------------------------------------------------------------------------
function Template_CanGiveup(lActorID, lNPCID)
	-- 返回0表示不可以放弃, 返回1表示可以放弃
end

-- ---------------------------
-- 玩家接受本任务时触发此函数
-- ---------------------------
function Template_Accept(lActorID, lNPCID)
end

-- ---------------------------
-- 玩家完成本任务时触发此函数
-- ---------------------------
function Template_Finish(lActorID, lNPCID)
end

-- ---------------------------
-- 玩家放弃本任务时触发此函数
-- ---------------------------
function Template_Giveup(lActorID)
end

-- ---------------------------
-- 玩家共享本任务时触发此函数
-- ---------------------------
function Template_Share(lActorID)
end

-- --------------------------------
-- 玩家上线时本任务初始化触发此函数
-- --------------------------------
function Template_Login(lActorID)
end

-- ----------------------------------
-- 玩家下线时本任务结束处理触发此函数
-- ----------------------------------
function Template_Logout(lActorID)
end
