----------------------------------------------------------------------------------------------------------------------
--文件名:	Scp\LUA\Other\GoodsPackage.lua
--版  权:	(C)  深圳网域计算机网络有限公司
--创建人:	张春明
--日  期:	2008-6-25
--版  本:	1.0
--描  述:	使用道具包裹
--应  用:
----------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------
--修改记录
--修改人: 张春明
--日  期: 2008-3-26
--描  述: 创建
--修改人：黄蕾
--时  间：2012-03-08
--内  容：增加时装大赛礼包
----------------------------------------------------------------------------------------------------------------------

--道具包裹内容表
GLOBAL_GoodsPackage_GoodsIDList={
	--[[0: 无绑定
		1：不可以交易、拍卖、给予、邮寄
		2：不可以出售给NPC
		3：=1+2
		4：切换地图消失
		5：1+4
		6：2+4
		7：1+2+4--]]
	--注意有重复的物品ID不同。


	--道具店
		--魔盒钥匙包
		[550] = {
					{ID=80455,Num=18,Bind=0},
				},


		--配方钥匙包
		[551] = {
					{ID=80454,Num=100},
				},


		--重生十字章包
		[552] = {
					{ID=80274,Num=20},
				},


		--聊天石包
		[553] = {
					{ID=80397,Num=12},
				},


		--英雄转换魔盒包
		[554] = {
					{ID=80394,Num=9},
				},


		--跳关符包
		[555] = {
					{ID=727,Num=23},
				},


		--背包续时油包
		[556] = {
					{ID=27,Num=40},
				},


		--界石包
		[557] = {
					{ID=765,Num=5},
				},


		--点金手套新手包
		[789] = {
					{ID=714,Num=5},
				},


		--点金手套包
		[715] = {
					{ID=714,Num=900},
				},


		--奶包
		[558] = {
					{ID=80486,Num=10},
				},


		--蛋包
		[559] = {
					{ID=80487,Num=10},
				},

		--劣质润滑剂包
		[587] = {
					{ID=80191,Num=3},
				},

		--四档套装激活魔盒包
		[588] = {
					{ID=80388,Num=2},
				},

		--[四档]士气药酒包
		[589] = {
					{ID=316,Num=10},
				},

		--[四档]超级士气药酒包
		[590] = {
					{ID=317,Num=10},
				},

		--超级点金手套包
		[591] = {
					{ID=315,Num=100},
				},


		--50空岛礼包
		[662] = {
					{ID=714,Num=100,Bind=3},
					{ID=80454,Num=50,Bind=3},
				},


		--100阳光礼包
		[663] = {
					{ID=714,Num=300,Bind=3},
					{ID=80274,Num=50,Bind=3},
				},


		--300绚彩礼包
		[664] = {
					{ID=9507,Num=1,Bind=3},
					{ID=27,Num=40,Bind=3},
				},


		--500华贵礼包
		[665] = {
					{ID=119,Num=100,Bind=3},
					{ID=80455,Num=100,Bind=3},
				},


		--800至尊礼包
		[666] = {
					{ID=714,Num=1000,Bind=3},
					{ID=80455,Num=100,Bind=3},
					{ID=80454,Num=100,Bind=3},
					{ID=80397,Num=50,Bind=3},
				},


		--1000英雄礼包
		[667] = {
					{ID=80181,Num=150,Bind=3},
					{ID=9507,Num=1,Bind=3},
					{ID=27,Num=40,Bind=3},
				},


		--豪华装普通合成魔盒包
		[846] = {
					{ID=80384,Num=1,Bind=3},
					{ID=118,Num=2,Bind=3},
					{ID=119,Num=2,Bind=3},
					{ID=208,Num=5,Bind=3},
					{ID=22,Num=1,Bind=3},
					{ID=23,Num=1,Bind=3},
					{ID=80274,Num=1,Bind=3},
				},

		--豪华装T2提炼石包
		[847] = {
					{ID=80399,Num=2,Bind=3},
					{ID=118,Num=2,Bind=3},
					{ID=119,Num=2,Bind=3},
					{ID=208,Num=5,Bind=3},
					{ID=22,Num=1,Bind=3},
					{ID=23,Num=1,Bind=3},
					{ID=80274,Num=1,Bind=3},
				},

		--豪华装T3提炼石包
		[848] = {
					{ID=80400,Num=2,Bind=3},
					{ID=118,Num=2,Bind=3},
					{ID=119,Num=2,Bind=3},
					{ID=208,Num=5,Bind=3},
					{ID=22,Num=1,Bind=3},
					{ID=23,Num=1,Bind=3},
					{ID=80274,Num=1,Bind=3},
				},


		--背包续时油包无用
		[668] = {
					{ID=27,Num=20},
				},


		--界石包运营
		[669] = {
					{ID=765,Num=5,Bind=3},
				},


		--奶包无用
		[670] = {
					{ID=80486,Num=300},
				},


		--蛋包无用
		[671] = {
					{ID=80487,Num=38},
				},


	--药品店
		--[特殊]微型能量药水包
		[560] = {
					{ID=206,Num=50},
				},


		--[特殊]小型能量药水包
		[561] = {
					{ID=207,Num=50},
				},


		--[特殊]中小型能量药水包
		[562] = {
					{ID=208,Num=50},
				},


		--[特殊]中型能量药水包
		[563] = {
					{ID=209,Num=50},
				},


		--[特殊]大型能量药水包
		[564] = {
					{ID=210,Num=50},
				},


		--[特殊]微型生命药水包
		[565] = {
					{ID=117,Num=50},
				},


		--[特殊]小型生命药水包
		[566] = {
					{ID=118,Num=50},
				},


		--[特殊]中小型生命药水包
		[567] = {
					{ID=119,Num=50},
				},


		--[特殊]中型生命药水包
		[568] = {
					{ID=120,Num=50},
				},


		--[特殊]大型生命药水包
		[569] = {
					{ID=121,Num=50},
				},


		--672到681都不需要用到
		--[特殊]微型能量药水包无用
		[672] = {
					{ID=206,Num=225},
				},


		--[特殊]小型能量药水包无用
		[673] = {
					{ID=207,Num=150},
				},


		--[特殊]中小型能量药水包无用
		[674] = {
					{ID=208,Num=90},
				},


		--[特殊]中型能量药水包无用
		[675] = {
					{ID=209,Num=75},
				},


		--[特殊]大型能量药水包无用
		[676] = {
					{ID=210,Num=74},
				},


		--[特殊]微型生命药水包无用
		[677] = {
					{ID=117,Num=100},
				},


		--[特殊]小型生命药水包无用
		[678] = {
					{ID=118,Num=70},
				},


		--[特殊]中小型生命药水包无用
		[679] = {
					{ID=119,Num=76},
				},


		--[特殊]中型生命药水包无用
		[680] = {
					{ID=120,Num=65},
				},


		--[特殊]大型生命药水包无用
		[681] = {
					{ID=121,Num=52},
				},



	--改造店
		--劣质合成魔盒包
		[570] = {
					{ID=80383,Num=10},
				},


		--普通合成魔盒包
		[571] = {
					{ID=80384,Num=10},
				},


		--劣质宝石合成剂包
		[572] = {
					{ID=80181,Num=10},
				},


		--T1提炼石包
		[573] = {
					{ID=80398,Num=13},
				},


		--T2提炼石包
		[574] = {
					{ID=80399,Num=9},
				},


		--T3提炼石包
		[575] = {
					{ID=80400,Num=6},
				},


		--T4提炼石包
		[576] = {
					{ID=80401,Num=6},
				},


		--1档套装激活魔盒包
		[577] = {
					{ID=80385,Num=2},
				},


		--2档套装激活魔盒包
		[578] = {
					{ID=80386,Num=2},
				},


		--3档套装激活魔盒包
		[579] = {
					{ID=80387,Num=2},
				},


		--劣质提炼魔盒包
		[580] = {
					{ID=80404,Num=10},
				},


		--普通提炼魔盒包
		[581] = {
					{ID=80405,Num=10},
				},


		--劣质点化魔盒包
		[582] = {
					{ID=80408,Num=10},
				},


		--普通点化魔盒包
		[583] = {
					{ID=80409,Num=10},
				},


		--普通润滑剂包
		[584] = {
					{ID=80192,Num=3},
				},

		--682到696都没不用到
		--劣质合成魔盒包
		[682] = {
					{ID=80383,Num=45},
				},


		--普通合成魔盒包
		[683] = {
					{ID=80384,Num=25},
				},


		--劣质宝石合成剂包
		[684] = {
					{ID=80181,Num=30},
				},


		--T1提炼石包
		[685] = {
					{ID=80398,Num=13},
				},


		--T2提炼石包
		[686] = {
					{ID=80399,Num=9},
				},


		--T3提炼石包
		[687] = {
					{ID=80400,Num=6},
				},


		--T4提炼石包
		[688] = {
					{ID=80401,Num=6},
				},


		--1档套装激活魔盒包
		[689] = {
					{ID=80385,Num=6},
				},


		--2档套装激活魔盒包
		[690] = {
					{ID=80386,Num=3},
				},


		--3档套装激活魔盒包
		[691] = {
					{ID=80387,Num=2},
				},


		--劣质提炼魔盒包
		[692] = {
					{ID=80404,Num=60},
				},


		--普通提炼魔盒包
		[693] = {
					{ID=80405,Num=25},
				},


		--劣质点化魔盒包
		[694] = {
					{ID=80408,Num=60},
				},


		--普通点化魔盒包
		[695] = {
					{ID=80409,Num=25},
				},


		--普通润滑剂包
		[696] = {
					{ID=80192,Num=10},
				},



	--生活技能店



	--土地道具店
		--资源刷新凭证包
		[585] = {
					{ID=80279,Num=2},
				},


		--土地续约凭证包
		[586] = {
					{ID=80280,Num=2},
				},


		--资源刷新凭证包
		[697] = {
					{ID=80279,Num=12},
				},


		--土地续约凭证包
		[698] = {
					{ID=80280,Num=15},
				},


	--紧急补给店


	--新手礼包
		--英雄岛礼包
		[699] = {
					{ID=80274,Num=1,Bind=3},
					{ID=714,Num=1,Bind=3},
					{ID=117,Num=1,Bind=3},
				},


		--初级奖励礼包
		[934] = {
					{ID=941,Num=25,Bind=3},
					{ID=942,Num=25,Bind=3},
					{ID=943,Num=25,Bind=3},
					{ID=912,Num=100,Bind=3},
				},


		--二次奖励包
		[935] = {
					{ID=933,Num=1,Bind=3},
					{ID=939,Num=25,Bind=3},
					{ID=940,Num=25,Bind=3},
					{ID=944,Num=21,Bind=3},
					{ID=908,Num=100,Bind=3},
				},


		--三次奖励包
		[936] = {
					{ID=784,Num=2,Bind=3},
					{ID=945,Num=2,Bind=3},
					{ID=80397,Num=70,Bind=3},
					{ID=714,Num=1000,Bind=3},
					{ID=765,Num=1000,Bind=3},
					{ID=904,Num=500,Bind=3},
					{ID=912,Num=300,Bind=3},
				},


		--四次奖励包
		[937] = {
					{ID=946,Num=2,Bind=3},
					{ID=947,Num=2,Bind=3},
					{ID=80485,Num=20,Bind=3},
					{ID=917,Num=50,Bind=3},
					{ID=919,Num=100,Bind=3},
					{ID=80397,Num=80,Bind=3},
					{ID=939,Num=100,Bind=3},
					{ID=940,Num=100,Bind=3},
				},


		--五次奖励包
		[938] = {
					{ID=9507,Num=2,Bind=3},
					{ID=80564,Num=200,Bind=3},
					{ID=80394,Num=250,Bind=3},
					{ID=911,Num=65,Bind=3},
					{ID=80563,Num=200,Bind=3},
				},


		--蛋包
		[945] = {
					{ID=80487,Num=10,Bind=3},
				},


		--[特殊]中小型能量药水包
		[946] = {
					{ID=208,Num=50,Bind=3},
				},


		--[特殊]中小型生命药水包
		[947] = {
					{ID=119,Num=50,Bind=3},
				},



	--士气道具店
		--【公民】士气药酒包
		[953] = {
					{ID=306,Num=10},
				},

		--【男爵】士气药酒包
		[954] = {
					{ID=307,Num=10},
				},

		--【子爵】士气药酒包
		[955] = {
					{ID=308,Num=10},
				},

		--【公民】超级士气药酒包
		[956] = {
					{ID=309,Num=10},
				},

		--【男爵】超级士气药酒包
		[957] = {
					{ID=310,Num=10},
				},

		--【子爵】超级士气药酒包
		[958] = {
					{ID=311,Num=10},
				},

		--【公民】超级点金手套包
		[959] = {
					{ID=312,Num=10},
				},

		--【男爵】超级点金手套包
		[960] = {
					{ID=313,Num=10},
				},

		--【子爵】超级点金手套包
		[961] = {
					{ID=314,Num=10},
				},


	--时装店
		--女管家时装包
		[966] = {
					{ID=10911,Num=1},
					{ID=10912,Num=1},
					NeedPoint = 1000,
				},

		--乖乖男时装包
		[967] = {
					{ID=10948,Num=1},
					{ID=10949,Num=1},
					NeedPoint = 1000,
				},

	--QQ活动礼包
		--【下载有礼】10格背包/9502//1//聊天石/80397/30//界石/765/2//小果冻/501/10
		[88057] = {
					{ID=9502,Num=1,Bind=3},
				--	{ID=80397,Num=30,Bind=3},
					{ID=765,Num=2,Bind=3},
					{ID=501,Num=10,Bind=3},
				},

		--【英雄岛】超级礼包/10格背包9502/1//聊天石80397/50//界石765/5//小果冻501/20//
		[88058] = {
					{ID=9502,Num=1,Bind=3},
				--	{ID=80397,Num=50,Bind=3},
					{ID=669,Num=1,Bind=3},
					{ID=501,Num=20,Bind=3},
				},

		--QQ会员超级礼包 顶锦亮羽披风/11023/1
		[88059] = {
					{ID=11023,Num=1,Bind=3},
				},

		--QQ会员特权礼包 专属称号	1件//时装续时油/75/1//14格背包/9504/1//聊天石/80397/50//界石/765/5//洗点十字章/80686/5//小果冻/501/20//QQ会员特权光环/548/1
		--[88060] = {
				--	{ID='Title',Num=1004},
				--	{ID=75,Num=1,Bind=3},
				--	{ID=9504,Num=1,Bind=3},
				--	{ID=80397,Num=50,Bind=3},
				--	{ID=669,Num=1,Bind=3},
				--	{ID=80686,Num=5,Bind=3},
				--	{ID=501,Num=20,Bind=3},
				--	{ID=548,Num=1,Bind=3},
				--},

		--QQ会员特权礼包 QQ特权英雄称号/1//QQ会员特权光环/1/548//10格背包/1/9502//玫瑰之约烟花/10/822//心语心愿烟花/10/819//烂漫之吻烟花/10/823//[特殊]小型生命药水/100/118//[特殊]小型能量药水/100/207//麦香吐司/30/801//风味热狗/30/802//水晶币兑换券/100/80696
		[88060] = {
					{ID='Title',Num=1004},
					{ID=548,Num=1,Bind=3},
					{ID=9502,Num=1,Bind=3},
					{ID=822,Num=10,Bind=3},
					{ID=819,Num=10,Bind=3},
					{ID=823,Num=10,Bind=3},
					{ID=118,Num=100,Bind=3},
					{ID=207,Num=100,Bind=3},
					{ID=801,Num=30,Bind=3},
					{ID=802,Num=30,Bind=3},
					{ID=80696,Num=100,Bind=3},
				},

		--QQ红钻特权礼包 酷炫亮羽披风/11022/1//时装续时油/75/1//浪漫之吻烟花/823/10//火树银花烟花/824/10//流星之夜烟花/821/10//小果冻/501/20//界石/765/5//QQ红钻特权光环/1/549
		[88061] = {
					{ID=11022,Num=1,Bind=3},
					{ID=75,Num=1,Bind=3},
					{ID=823,Num=10,Bind=3},
					{ID=824,Num=10,Bind=3},
					{ID=821,Num=10,Bind=3},
					{ID=501,Num=20,Bind=3},
					{ID=669,Num=1,Bind=3},
					{ID=549,Num=1,Bind=3},
				--	{ID=80397,Num=20,Bind=3},
				},

		--QQ黄钻·蓓蕾特权礼包 专属称号1件//王者亮羽披风/11024/1//时装续时油/75/1//爆竹/853/10//玫瑰之约烟花/822/10//心语心愿烟花/819/10//小果冻/501/20//界石/765/5//QQ黄钻特权光环/1/545
		[88062] = {
					{ID='Title',Num=1005},
					{ID=11024,Num=1,Bind=3},
					{ID=75,Num=1,Bind=3},
					{ID=853,Num=10,Bind=3},
					{ID=822,Num=10,Bind=3},
					{ID=819,Num=10,Bind=3},
					{ID=501,Num=20,Bind=3},
					{ID=669,Num=1,Bind=3},
					{ID=545,Num=1,Bind=3},
				--	{ID=80397,Num=20,Bind=3},
				},

		--QQ蓝钻特权礼包 俏皮亮羽披风/11025/1//时装续时油/75/1//双倍经验药水/88065/1//重生十字章/80274/10//界石/765/5//聊天石/80397/50//QQ蓝钻特权光环/1/546
		[88063] = {
					{ID=11025,Num=1,Bind=3},
					{ID=75,Num=1,Bind=3},
					{ID=88065,Num=1,Bind=3},
					{ID=80274,Num=10,Bind=3},
					{ID=669,Num=1,Bind=3},
				--	{ID=80397,Num=50,Bind=3},
					{ID=546,Num=1,Bind=3},
				},

		--虎年英雄包
		[88064] = {
				--	{ID=11021,Num=1,Bind=3},--QQ会员特制披风
					{ID=80696,Num=100,Bind=3},--水晶币兑换券
					{ID=118,Num=100,Bind=3},--[特殊]小型生命药水
					{ID=207,Num=100,Bind=3},--[特殊]小型能量药水
					{ID=801,Num=30,Bind=3},--麦香吐司
					{ID=802,Num=30,Bind=3},--风味热狗
					{ID=9502,Num=1,Bind=3},--10格背包
					{ID=822,Num=10,Bind=3},--玫瑰之约
					{ID=819,Num=10,Bind=3},--心语星愿
					{ID=823,Num=10,Bind=3},--浪漫之吻
				--	{ID=80397,Num=50,Bind=3},--聊天石
				--	{ID=547,Num=1,Bind=3},--QQ网吧特权光环
				},

	--QQ公主礼包
		--芳菲公主特权礼包//王者亮羽披风/1/11024//羽翼天使头饰[婚纱]/1/10932//羽翼天使婚纱[婚纱]/1/10933//“芳菲公主”专属称号//时装续时油/1/75//爆竹/10/853//玫瑰之约烟花/10/822//心语心愿烟花/10/819//小果冻/20/501//界石/5/765//QQ黄钻特权光环/1/545
		[88071] = {
					{ID='Title',Num=1006},
					{ID=11024,Num=1,Bind=3},
					{ID=10932,Num=1,Bind=3},
					{ID=10933,Num=1,Bind=3},
					{ID=75,Num=1,Bind=3},
					{ID=853,Num=10,Bind=3},
					{ID=822,Num=10,Bind=3},
					{ID=819,Num=10,Bind=3},
					{ID=501,Num=20,Bind=3},
					{ID=669,Num=1,Bind=3},
					{ID=545,Num=1,Bind=3},
				--	{ID=80397,Num=10,Bind=3},
				},

		--红颜公主特权礼包
		[88072] = {
					{ID='Title',Num=1007},
					{ID=11024,Num=1,Bind=3},
					{ID=75,Num=1,Bind=3},
					{ID=853,Num=10,Bind=3},
					{ID=822,Num=10,Bind=3},
					{ID=819,Num=10,Bind=3},
					{ID=501,Num=20,Bind=3},
					{ID=669,Num=1,Bind=3},
					{ID=545,Num=1,Bind=3},
				},

		--橙星公主特权礼包
		[88073] = {
					{ID='Title',Num=1008},
					{ID=11024,Num=1,Bind=3},
					{ID=75,Num=1,Bind=3},
					{ID=853,Num=10,Bind=3},
					{ID=822,Num=10,Bind=3},
					{ID=819,Num=10,Bind=3},
					{ID=501,Num=20,Bind=3},
					{ID=669,Num=1,Bind=3},
					{ID=545,Num=1,Bind=3},
				},

		--黄鹂公主特权礼包
		[88074] = {
					{ID='Title',Num=1009},
					{ID=11024,Num=1,Bind=3},
					{ID=75,Num=1,Bind=3},
					{ID=853,Num=10,Bind=3},
					{ID=822,Num=10,Bind=3},
					{ID=819,Num=10,Bind=3},
					{ID=501,Num=20,Bind=3},
					{ID=669,Num=1,Bind=3},
					{ID=545,Num=1,Bind=3},
				},

		--绿光公主特权礼包
		[88075] = {
					{ID='Title',Num=1010},
					{ID=11024,Num=1,Bind=3},
					{ID=75,Num=1,Bind=3},
					{ID=853,Num=10,Bind=3},
					{ID=822,Num=10,Bind=3},
					{ID=819,Num=10,Bind=3},
					{ID=501,Num=20,Bind=3},
					{ID=669,Num=1,Bind=3},
					{ID=545,Num=1,Bind=3},
				},

		--青黛公主特权礼包
		[88076] = {
					{ID='Title',Num=1011},
					{ID=11024,Num=1,Bind=3},
					{ID=75,Num=1,Bind=3},
					{ID=853,Num=10,Bind=3},
					{ID=822,Num=10,Bind=3},
					{ID=819,Num=10,Bind=3},
					{ID=501,Num=20,Bind=3},
					{ID=669,Num=1,Bind=3},
					{ID=545,Num=1,Bind=3},
				},

		--蓝馨公主特权礼包
		[88077] = {
					{ID='Title',Num=1012},
					{ID=11024,Num=1,Bind=3},
					{ID=75,Num=1,Bind=3},
					{ID=853,Num=10,Bind=3},
					{ID=822,Num=10,Bind=3},
					{ID=819,Num=10,Bind=3},
					{ID=501,Num=20,Bind=3},
					{ID=669,Num=1,Bind=3},
					{ID=545,Num=1,Bind=3},
				},

		--紫郁公主特权礼包
		[88078] = {
					{ID='Title',Num=1013},
					{ID=11024,Num=1,Bind=3},
					{ID=75,Num=1,Bind=3},
					{ID=853,Num=10,Bind=3},
					{ID=822,Num=10,Bind=3},
					{ID=819,Num=10,Bind=3},
					{ID=501,Num=20,Bind=3},
					{ID=669,Num=1,Bind=3},
					{ID=545,Num=1,Bind=3},
				},


	--【英雄岛】88元大礼包
		[88079] = {
					{ID=9502,Num=1,Bind=3},--10格背包
					{ID=80696,Num=1000,Bind=3},--水晶币兑换券
					{ID=822,Num=10,Bind=3},--玫瑰之约烟花
					{ID=819,Num=10,Bind=3},--心语心愿烟花
					{ID=823,Num=10,Bind=3},--浪漫之吻烟花
				},
	--皇冠礼包
		[88098] = {
					{ID='Title',Num=1004},--专属称号
					{ID=11023,Num=1,Bind=3},--顶锦亮羽披风
					{ID=88065,Num=1,Bind=3},--双倍经验卡
					{ID=9503,Num=1,Bind=3},--12格背包
					{ID=501,Num=5,Bind=3},--小果冻
					{ID=820,Num=10,Bind=3},--旷世情缘烟花
					{ID=822,Num=10,Bind=3},--玫瑰之约烟花
					{ID=819,Num=10,Bind=3},--心语心愿烟花
					{ID=825,Num=10,Bind=3},--罗曼天堂烟花
				},

	--钻石礼包
		[88099] = {
					{ID='Title',Num=1004},--专属称号
					{ID=11023,Num=1,Bind=3},--顶锦亮羽披风
					{ID=88065,Num=1,Bind=3},--双倍经验卡
					{ID=9502,Num=1,Bind=3},--10格背包
					{ID=858,Num=10,Bind=3},--恭喜发财烟花
					{ID=859,Num=10,Bind=3},--万事如意烟花
				},
	--白金礼包
		[88100] = {
					{ID=9502,Num=1,Bind=3},--10格背包
					{ID=80696,Num=100,Bind=3},--水晶币兑换券
					{ID=118,Num=100,Bind=3},--[特殊]小型生命药水
					{ID=207,Num=100,Bind=3},--[特殊]小型能量药水
				},
	--QQ传递达人礼包
		[88148] = {
					{ID='Title',Num=1014},--QQ传递达人称号
					{ID=88135,Num=100,Bind=3},--幸运星
				},
	--贺岁公测大礼包：雪人仆从包/88867//1//辞旧迎新大红包/88868/1//瞬回饺子/88869/1//愿望成真烟花/88870/10
		[88866] = {
					{ID=88867,Num=1,Bind=3},
					{ID=88868,Num=1,Bind=3},
					{ID=88869,Num=1,Bind=3},
					{ID=88870,Num=10,Bind=3},
				},
		[88906] = {
					{ID=11537,Num=1,Bind=3},
					{ID=11538,Num=1,Bind=3},
					{ID=11511,Num=1,Bind=3},
					{ID=11512,Num=1,Bind=3},
					{ID=902,Num=100,Bind=3},
					{ID=904,Num=100,Bind=3},
					{ID=907,Num=100,Bind=3},
					{ID=80818,Num=4000,Bind=3},
					{ID=82018,Num=20,Bind=3},
					{ID=82034,Num=2000,Bind=3},
				},
		[88907] = {
					{ID=11539,Num=1,Bind=3},
					{ID=11540,Num=1,Bind=3},
					{ID=11511,Num=1,Bind=3},
					{ID=11512,Num=1,Bind=3},
					{ID=902,Num=100,Bind=3},
					{ID=904,Num=100,Bind=3},
					{ID=907,Num=100,Bind=3},
					{ID=80818,Num=4000,Bind=3},
					{ID=82018,Num=20,Bind=3},
					{ID=82034,Num=2000,Bind=3},
				},
		[89300] = {
					{ID=989,Num=20,Bind=3},
					{ID=988,Num=20,Bind=3},
					},
		[89301] = {
					{ID=82018,Num=200,Bind=3},
					{ID=83113,Num=50,Bind=3},
					},
	--海盗水手制服礼包
		[88935] = {
					{ID={[1]=11249,[2]=11251,Judge = 'Sex'},Num=1,Bind=3}, --性别判断（1、男；2、女）
			--		{ID={[0]=11249,[1]=11251,Judge = 'Camp'},Num=1,Bind=3}, --阵营判断（0、帝国；1、联邦）
			--		{ID={[1]=11249,[2]=11251,[3]=11251,Judge = 'Job'},Num=1,Bind=3}, --职业判断（1、物理；2、火药；3、魔法）
				},
	--海盗水手帽子礼包
		[88938] = {
					{ID={[1]=11248,[2]=11250,Judge = 'Sex'},Num=1,Bind=3},
				},
	--马戏团衣服礼包
		[88939] = {
					{ID={[1]=10987,[2]=10995,Judge = 'Sex'},Num=1,Bind=3},
				},
	--马戏团帽子礼包
		[88936] = {
					{ID={[1]=10986,[2]=10994,Judge = 'Sex'},Num=1,Bind=3},
				},
	--移动大礼包
		[88937] = {
					{ID=80696,Num=100,Bind=3},--水晶币兑换券
					{ID=118,Num=100,Bind=3},--[特殊]小型生命药水
					{ID=207,Num=100,Bind=3},--[特殊]小型能量药水
					{ID=801,Num=30,Bind=3},--麦香吐司
					{ID=802,Num=30,Bind=3},--风味热狗
					{ID=9502,Num=1,Bind=3},--10格背包
					{ID=822,Num=10,Bind=3},--玫瑰之约
					{ID=819,Num=10,Bind=3},--心语星愿
					{ID=823,Num=10,Bind=3},--浪漫之吻
				},
	--一步登天礼包
		[88946] = {
					{ID={[1]=80381,[2]=80382,Judge = 'Level',Lv = {[1] = 10,[2] = 100}},Num=5,Bind=3}, --等级判断（1、25级以下；2、40级以下）
					{ID={[1]=80383,[2]=80384,Judge = 'Level',Lv = {[1] = 10,[2] = 100}},Num=5,Bind=3}, --等级判断（1、25级以下；2、40级以下）
					{ID={[2]=80387,Judge = 'Level',Lv = {[1] = 10,[2] = 100}},Num=1,Bind=3}, --等级判断（1、25级以下；2、40级以下）
					{ID=82004,Num={[1]=57,[2]=108,[3]=197,[4]=293,[5]=417,[6]=662,[7]=1140,[8]=1200,Judge = 'Level',Lv = {[1] = 10,[2] = 15,[3] = 20,[4] = 25,[5] = 30,[6] = 35,[7] = 40,[8] = 100}},Bind=3},
					DialogBox = 1,
				},
	--夏日新人礼包
		[88947] = {
					--{ID={[1]=11280,[2]=11279,Judge = 'Sex'},Num=1,Bind=3},--门将服装
					{ID={[1]=11292,[2]=11291,Judge = 'Sex'},Num=1,Bind=3},--足球时装
					{ID=31019,Num=1,Bind=3},--蝶精灵卡
					{ID=31015,Num=1,Bind=3},--绿龙宝宝卡
					{ID=31016,Num=1,Bind=3},--恶魔猪卡
					DialogBox = 2,
				},
	--夏日狂欢大礼包
		[88948] = {
					{ID={[1]=80686,[2]=80686,[3]=75,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},
					Num={[1]=1,[2]=1,[3]=1,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},Bind=3}, --等级判断（1、25级以下；2、40级以下）
					{ID={[1]=80274,[2]=80689,[3]=80689,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},
					Num={[1]=5,[2]=1,[3]=1,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},Bind=3}, --等级判断（1、25级以下；2、40级以下）
					{ID={[1]=31032,[2]=31033,Judge = 'rand',value = 2},Num=1,Bind=3,Odds={[31032]=1000,[31033]=300}},
					--{ID=31032-31033,Num=1,Bind=3,Odds=300},
				},
	--每日奖励大礼包
		[88951] = {
					{ID={[1]=766,[2]=766,[3]=207,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},
					Num={[1]=10,[2]=10,[3]=3,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},Bind=3}, --等级判断（1、25级以下；2、40级以下）
					{ID={[1]=767,[2]=767,[3]=208,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},
					Num={[1]=10,[2]=10,[3]=3,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},Bind=3}, --等级判断（1、25级以下；2、40级以下）
					{ID={[1]=80274,[2]=80192,[3]=311,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},
					Num={[1]=1,[2]=5,[3]=3,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},Bind=3}, --等级判断（1、25级以下；2、40级以下）
					{ID={[1]=80191,[3]=250,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},
					Num={[1]=10,[3]=2,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},Bind=3}, --等级判断（1、25级以下；2、40级以下）
					{ID={[1]=771,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},
					Num={[1]=10,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},Bind=3}, --等级判断（1、25级以下；2、40级以下）
				},
	--七夕情缘礼包
		[88953] = {
					{ID={[1]=11305,[2]=11303,Judge = 'Sex'},Num=1,Bind=0},
					{ID={[1]=11306,[2]=11304,Judge = 'Sex'},Num=1,Bind=0},
				},
	--联赛冠军荣誉礼盒（队长）
		[88962] = {
					{ID={[1]=11017,[2]=11014,Judge = 'Sex'},Num=1,Bind=3},
					{ID={[1]=11018,[2]=11015,Judge = 'Sex'},Num=1,Bind=3},
					{ID={[1]=11019,[2]=11016,Judge = 'Sex'},Num=1,Bind=3},
					{ID=32001,Num=5,Bind=1},
				},
	--联赛冠军荣誉礼盒（队员）
		[88963] = {
					{ID={[1]=11017,[2]=11014,Judge = 'Sex'},Num=1,Bind=3},
					{ID={[1]=11018,[2]=11015,Judge = 'Sex'},Num=1,Bind=3},
					{ID=32001,Num=5,Bind=1},
				},
	--联赛32强尊享礼包
		[88964] = {
					{ID=501,Num=20,Bind=3},--
					{ID=32001,Num=2,Bind=3},--
					{ID=75,Num=4,Bind=3},--
					{ID=82004,Num=500,Bind=3},--
					{ID=80696,Num=500,Bind=3},--
				},
	--跨服联赛纪念礼包
	--聊天石20个+重生十字章10个+超级经验兑换券300张+水晶币兑换券300张
		[88965] = {
					{ID=80397,Num=20,Bind=3},--
					{ID=80274,Num=10,Bind=3},--
					{ID=82004,Num=300,Bind=3},--
					{ID=80696,Num=300,Bind=3},--
				},
	--普天同庆大礼包（一档）
	--经验兑换券800张+水晶币兑换券80张+劣质升级魔晶10个+劣质合成魔晶10个
		[88966] = {
					{ID=80498,Num=800,Bind=3},--
					{ID=80696,Num=80,Bind=3},--
					{ID=80381,Num=10,Bind=3},--
					{ID=80383,Num=10,Bind=3},--
				},
	--普天同庆大礼包（二档）
	--经验兑换券2000张+水晶币兑换券200张+普通升级魔晶10个+普通合成魔晶10个
		[88967] = {
					{ID=80498,Num=2000,Bind=3},--
					{ID=80696,Num=200,Bind=3},--
					{ID=80382,Num=10,Bind=3},--
					{ID=80384,Num=10,Bind=3},--
				},
	--普天同庆大礼包（三档）
	--经验兑换券3000张+水晶币兑换券300张+战斗技能经验卷10张+重生十字章5个
		[88968] = {
					{ID=80498,Num=3000,Bind=3},--
					{ID=80696,Num=300,Bind=3},--
					{ID=80832,Num=10,Bind=3},--
					{ID=80274,Num=5,Bind=3},--
				},
	--新手时装礼包
		[88981] = {
					{ID={[1]=11318,[2]=11320,Judge = 'Sex'},Num=1,Bind=3},
					{ID={[1]=11319,[2]=11321,Judge = 'Sex'},Num=1,Bind=3},
				},
	--双“蛋”有礼超级大礼包
		[88983] = {
					{ID=82004,Num=100,Bind=3},--10个超级经验兑换券
				},
	--新手礼包
		[88984] = {
					{ID=80397,Num=5,Bind=3},--聊天石5枚
					{ID=31016,Num=1,Bind=3},--恶魔猪宝宝卡-新手宠物卡一张
					{ID=80498,Num=300,Bind=3},--经验兑换券300
					{ID=80696,Num=300,Bind=3},--水晶币兑换卷300
					{ID=202,Num=100,Bind=3},--小型能量药水100
					{ID=102,Num=100,Bind=3},--生命药水100
					{ID=88985,Num=1,Bind=3},--新手礼包B
				},
	--新手礼包B
		[88985] = {
					{ID=88986,Num=1,Bind=3},--新手礼包C
					{ID={[1]=11318,[2]=11320,Judge = 'Sex'},Num=1,Bind=3},
					{ID={[1]=11319,[2]=11321,Judge = 'Sex'},Num=1,Bind=3},
					{ID=80397,Num=10,Bind=3},--聊天石10个
					{ID=80274,Num=10,Bind=3},--重生十字章10枚
				},
	--新手礼包C
		[88986] = {
					{ID=78,Num=1,Bind=3},--载具胶囊1
					{ID=501,Num=10,Bind=3},--小果冻10
					{ID=80397,Num=20,Bind=3},--聊天石20
					{ID=80274,Num=10,Bind=3},--重生十字章10枚
					{ID=82004,Num=500,Bind=3},--超级经验兑换券500
				},
	--每周礼包
		[88987] = {
					{ID=80274,Num=5,Bind=3},--重生十字章5个
					{ID=80397,Num=20,Bind=3},--聊天石20个
					{ID=75,Num=2,Bind=3},--时装续时油2个
					{ID=82004,Num=300,Bind=3},--超级经验兑换券300个
				},
	--嘉年华大礼包
		[88993] = {
					{ID=31037,Num=1,Bind=3},--嘉年华纪念宠物
					{ID=80397,Num=20,Bind=3},--聊天石x20
					{ID=88044,Num=1,Bind=3},--宠物拾取徽章x1
					{ID=80686,Num=20,Bind=3},--宠物洗点十字章x20
					{ID=32001,Num=1,Bind=3},--载具攻击续时油x1
				},
	--VIP1大礼包
		[88988] = {
					{ID=80274,Num=20,Bind=3},--重生十字章20
					{ID=80397,Num=30,Bind=3},--聊天石30
					{ID=32001,Num=2,Bind=3},--载具续时油2
					{ID=75,Num=5,Bind=3},--时装续时油5
					{ID=82004,Num=500,Bind=3},--超级经验兑换券500
				},
	--VIP3大礼包
		[88989] = {
					{ID=80274,Num=30,Bind=3},--重生十字章30
					{ID=32001,Num=4,Bind=3},--载具续时油4
					{ID=75,Num=7,Bind=3},--时装续时油7
					{ID=82004,Num=1000,Bind=3},--超级经验兑换券1000
					{ID=38345,Num=1,Bind=3},--一套圣诞饰品房屋
					{ID=38346,Num=1,Bind=3},
					{ID=38348,Num=1,Bind=3},
					{ID={[1]=31024,[2]=31025,Judge = 'rand',value = 2},Num=1,Bind=3,Odds={[31024]=100,[31025]=300}},--(宠物ID：31024或者31025)
				},
	--VIP5大礼包
		[88990] = {
					{ID=80384,Num=5,Bind=3},--普通合成魔晶5
					{ID=80382,Num=5,Bind=3},--普通升级魔晶5
					{ID=80952,Num=5,Bind=3},--四档升档魔晶3
					{ID=82004,Num=2000,Bind=3},--超级经验兑换券2000
					{ID=38345,Num=1,Bind=3},--一套圣诞饰品房屋
					{ID=38347,Num=1,Bind=3},
					{ID=38349,Num=1,Bind=3},
					{ID=31030,Num=1,Bind=3,Odds=50},--(宠物ID：31030)
				},
	--会员大礼包1
		[89048] = {
					{ID=80274,Num=5,Bind=3},--重生十字章5
					{ID=80397,Num=10,Bind=3},--聊天石10
					{ID=11339,Num=1,Bind=3},--顶锦亮羽披风
					{ID=89049,Num=1,Bind=3},--会员大礼包2
				},
	--会员大礼包2
		[89049] = {
					{ID=80274,Num=5,Bind=3},--重生十字章5
					{ID=80397,Num=10,Bind=3},--聊天石10
					{ID=80381,Num=20,Bind=3},--劣质升级魔晶20
					{ID=80383,Num=20,Bind=3},--劣侄合成魔晶20
					{ID=82004,Num=100,Bind=3},--超级经验兑换券100
					{ID=902,Num=1,Bind=3},--紫灵菇1
					{ID=501,Num=5,Bind=3},--小果冻5
					{ID=89050,Num=1,Bind=3},--会员大礼包3
					},
	--会员大礼包3
		[89050] = {
					{ID=80274,Num=5,Bind=3},--重生十字章5
					{ID=80397,Num=20,Bind=3},--聊天石20
					{ID=80381,Num=30,Bind=3},--劣质升级魔晶30
					{ID=80383,Num=30,Bind=3},--劣侄合成魔晶30
					{ID=82004,Num=300,Bind=3},--超级经验兑换券300
					{ID=902,Num=1,Bind=3},--紫灵菇1
					{ID=501,Num=5,Bind=3},--小果冻5
					{ID=75,Num=2,Bind=3},--时装续时油2
					{ID={[1]=11342,[2]=11340,Judge = 'Sex'},Num=1,Bind=3},--会员时装一套
					{ID={[1]=11343,[2]=11341,Judge = 'Sex'},Num=1,Bind=3},
					{ID=89051,Num=1,Bind=3},--会员大礼包4
				},
	--会员大礼包4
		[89051] = {
					{ID=80274,Num=5,Bind=3},--重生十字章5
					{ID=80397,Num=30,Bind=3},--聊天石30
					{ID=80382,Num=20,Bind=3},--普通升级魔晶20
					{ID=80384,Num=20,Bind=3},--普通合成魔晶20
					{ID=82004,Num=500,Bind=3},--超级经验兑换券500
					{ID=902,Num=1,Bind=3},--紫灵菇1
					{ID=501,Num=5,Bind=3},--小果冻5
					{ID=75,Num=4,Bind=3},--时装续时油4
					{ID=89052,Num=1,Bind=3},--会员大礼包5
				},
	--会员大礼包5
		[89052] = {
					{ID=80274,Num=10,Bind=3},--重生十字章10
					{ID=80397,Num=30,Bind=3},--聊天石30
					{ID=80382,Num=30,Bind=3},--普通升级魔晶30
					{ID=80384,Num=30,Bind=3},--普通合成魔晶30
					{ID=82004,Num=1100,Bind=3},--超级经验兑换券1100
					{ID=902,Num=2,Bind=3},--紫灵菇2
					{ID=501,Num=5,Bind=3},--小果冻5
					{ID=75,Num=4,Bind=3},--时装续时油4
				},
	--二档盾和武器配方包
		[89056] = {
					{ID=80049,Num=100},--二档盾和武器配方100个
					},
	--三档盾和武器配方包
		[89057] = {
					{ID=80050,Num=100},--三档盾和武器配方100个
					},
	--四档盾和武器配方包
		[89058] = {
					{ID=80051,Num=100},--四档盾和武器配方100个
					},					
	--二档防具配方包
		[89059] = {
					{ID=80065,Num=100},--二档防具配方100个
					},
	--三档防具配方包
		[89060] = {
					{ID=80066,Num=100},--三档防具配方100个
					},
	--四档防具配方包
		[89061] = {
					{ID=80067,Num=100},--四档防具配方100个
					},					
	--宠物速成包
		[89066] = {
					{ID=80686,Num=25},--宠物洗点十字章25个
					{ID=80689,Num=25},--宠物技能重置玩偶25个
					{ID=88991,Num=10},--宠物经验丹10个
					{ID=31101,Num=5},--宠物小型寿命灵芝5个
					},
	--PK补给包
		[89067] = {
					{ID=120,Num=100},--[特殊]中型生命药水100个
					{ID=209,Num=100},--[特殊]中型能量药水100个
					{ID=250,Num=300},--[一档]圣果300个
					{ID=211,Num=30},--能量烈酒30个
					},
	--拉锯补给包
		[89068] = {
					{ID=80274,Num=300},--重生十字章300个
					{ID=80394,Num=10},--英雄转换魔晶10个
					{ID=317,Num=20},--[四档]超级士气药酒20个
					{ID=315,Num=100},--超级点金手套100个
					},
	--续时补给包
		[89069] = {
					{ID=32001,Num=4},--载具攻击续时油4个
					{ID=32101,Num=4},--载具小型耐久棒4个
					{ID=88044,Num=2},--拾取徽章2个
					{ID=75,Num=15},--时装续时油15个
					},
	--成长达人礼包
		[89082] = {
					{ID=82004,Num=1000,Bind=3},--超级经验兑换券1000
					{ID=80696,Num=9999,Bind=3},--水晶币兑换卷9999
					{ID=9507,Num=1,Bind=3},--20格背包
					{ID=80397,Num=100,Bind=3},--聊天石100	
					},
	--助长礼包16
		[89083] = {
					{ID=80498,Num=200,Bind=3},--经验兑换券200
					{ID=80696,Num=200,Bind=3},--水晶币兑换卷200
					{ID=80065,Num=200,Bind=3},--二档防具配方200
					{ID=80049,Num=200,Bind=3},--二档盾和武器配方200
					{ID=80383,Num=10,Bind=3},--劣质合成魔晶10
					{ID=765,Num=1,Bind=3},--界石1		
					},					
	--助长礼包21
		[89084] = {
					{ID=80498,Num=500,Bind=3},--经验兑换券500
					{ID=80696,Num=500,Bind=3},--水晶币兑换卷500
					{ID=82032,Num=3,Bind=3},--VIP防守凭证3
					{ID=80621,Num=3,Bind=3},--超级VIP卡3
					{ID=80381,Num=10,Bind=3},--劣质升级魔晶10
					{ID=80195,Num=10,Bind=3},--二档分解材料10	
					},					
	--助长礼包26
		[89085] = {
					{ID=80498,Num=1000,Bind=3},--经验兑换券1000
					{ID=80696,Num=1000,Bind=3},--水晶币兑换卷1000
					{ID=80066,Num=100,Bind=3},--三档防具配方100
					{ID=80050,Num=100,Bind=3},--三档盾和武器配方100
					{ID=80384,Num=10,Bind=3},--普通合成魔晶10
					{ID=80196,Num=10,Bind=3},--三档分解材料10
					},
	--助长礼包31
		[89086] = {
					{ID=82004,Num=100,Bind=3},--超级经验兑换券100
					{ID=80696,Num=1000,Bind=3},--水晶币兑换卷1000
					{ID=119,Num=50,Bind=3},--[特殊]中小型生命药水50
					{ID=208,Num=50,Bind=3},--[特殊]中小型能量药水50
					{ID=250,Num=50,Bind=3},--[一档]圣果50
					{ID=80382,Num=10,Bind=3},--普通升级魔晶10
					},
	--助长礼包36
		[89087] = {
					{ID=82004,Num=200,Bind=3},--超级经验兑换券200
					{ID=80696,Num=2000,Bind=3},--水晶币兑换卷2000
					{ID=75,Num=2,Bind=3},--时装续时油2
					{ID=80397,Num=10,Bind=3},--聊天石10
					{ID=501,Num=10,Bind=3},--小果冻10
					{ID=902,Num=1,Bind=3},--紫灵菇1
					},
	--助长礼包41
		[89088] = {
					{ID=82004,Num=300,Bind=3},--超级经验兑换券300
					{ID=80696,Num=3000,Bind=3},--水晶币兑换卷3000
					{ID=80686,Num=5,Bind=3},--宠物洗点十字章5个
					{ID=80689,Num=5,Bind=3},--宠物技能重置玩偶5个
					{ID=80274,Num=10,Bind=3},--重生十字章10
					{ID=211,Num=10,Bind=3},--能量烈酒10
					},	
	--国庆大礼包
		[89092] = {
					{ID={[1]=80195,[2]=80196,[3]=80197,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},
						Num={[1]=30,[2]=30,[3]=30,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},Bind=3}, --等级判断（1、25级以下；2、40级以下）
					{ID={[1]=80065,[2]=80066,[3]=80067,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},
						Num={[1]=100,[2]=100,[3]=100,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},Bind=3}, --等级判断（1、25级以下；2、40级以下）
					{ID={[1]=80049,[2]=80050,[3]=80051,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},
						Num={[1]=100,[2]=100,[3]=100,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},Bind=3}, --等级判断（1、25级以下；2、40级以下）
					{ID={[1]=82004,[2]=82004,[3]=82004,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},
						Num={[1]=100,[2]=400,[3]=800,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},Bind=3}, --等级判断（1、25级以下；2、40级以下）
					{ID={[1]=80381,[2]=80382,[3]=80382,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},
						Num={[1]=25,[2]=25,[3]=25,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},Bind=3}, --等级判断（1、25级以下；2、40级以下）	
					{ID={[1]=80383,[2]=80384,[3]=80384,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},
						Num={[1]=25,[2]=25,[3]=25,Judge = 'Level',Lv = {[1] = 25,[2] = 40,[3] = 100}},Bind=3}, --等级判断（1、25级以下；2、40级以下）						
					},
	--洗点十字章包(50个)
		[89112] = {
					{ID=80686,Num=50},--宠物洗点十字章50个
					},
	--洗点十字章包(50个)
		[89113] = {
					{ID=80686,Num=100},--宠物洗点十字章100个
					},
	--宠物技能重置玩偶包(50个)
		[89114] = {
					{ID=80689,Num=50},--宠物技能重置玩偶50个
					},
	--宠物技能重置玩偶包(100个)
		[89115] = {
					{ID=80689,Num=100},--宠物技能重置玩偶100个
					},
	--洗点十字章包(10个)
		[89116] = {
					{ID=80686,Num=10},--宠物洗点十字章10个
					},
	--宠物技能重置玩偶包(10个)
		[89117] = {
					{ID=80689,Num=10},--宠物技能重置玩偶10个
					},
	--英雄回归礼包
		[89119] = {
					{ID=76,Num=1,Bind=3,StarLv=5},--五星宠物胶囊（绑）
					{ID=82004,Num=1000,Bind=3},--超级经验兑换券1000个
					{ID=80696,Num=9999,Bind=3},--水晶币兑换券9999个
					{ID=82031,Num=50,Bind=3},--高级荣誉勋章50个
					{ID=82030,Num=500,Bind=3},--荣誉勋章500个
					},
	--英雄回归礼包
		[89120] = {
					{ID=82004,Num=100,Bind=3},--超级经验兑换券100个
					{ID=80696,Num=1000,Bind=3},--水晶币兑换券1000个
					{ID=207,Num=30,Bind=3},--[特殊]小型能量药水30个
					{ID=118,Num=30,Bind=3},--[特殊]小型生命药水30个
					{ID=250,Num=30,Bind=3},--圣果30个
					},
	--圣诞祝福礼包
		[89127] = {
					{ID={[1]=11523,[2]=11525,Judge = 'Sex'},Num=1,Bind=0},
					{ID={[1]=11524,[2]=11526,Judge = 'Sex'},Num=1,Bind=0},
					},
	--心悦礼包
		[89128] = {
					{ID=89080,Num=1,Bind=3},--双倍经验卡15天1个
					{ID=76,Num=1,Bind=3,StarLv=3},--三星宠物胶囊（绑）
					{ID=82030,Num=200,Bind=3},--荣誉勋章200个
					{ID=82031,Num=20,Bind=3},--高级荣誉勋章20个
					{ID=31014,Num=1,Bind=3},--雷霆兽卡1张		
					{ID=82034,Num=5,Bind=3},--五彩晶石5个					
					},
	--超悦礼包
		[89129] = {
					{ID=76,Num=1,Bind=5,StarLv=5},
					{ID=31030,Num=1,Bind=3},					
					},
		[89132] = {
					{ID={[1]=11527,[2]=11529,Judge = 'Sex'},Num=1,Bind=3},
					{ID={[1]=11528,[2]=11530,Judge = 'Sex'},Num=1,Bind=3},
					{ID=89118,Num=10,Bind=3},--修炼令牌
					{ID=82034,Num=20,Bind=3},--五彩晶石
					{ID=89080,Num=1,Bind=3},--双倍经验卡15天
					{ID=80397,Num=20,Bind=3},--聊天石
					},
		--时装大赛礼包（女）
		[89148] = {
					{ID=9507,Num=5},
					{ID=89187,Num=9999},
					{ID=89187,Num=9999},
					{ID=89186,Num=9999},
					{ID=89196,Num=1000},
					{ID=88663,Num=1000},
					{ID=80818,Num=9999},
					{ID=80818,Num=9999},
					{ID=80081,Num=99999999},
					{ID=88944,Num=100},
				},
		--时装大赛礼包（男）
		[89149] = {
					{ID=32023,Num=1},
					{ID=31043,Num=1},
					{ID=31044,Num=1},
					{ID=31030,Num=1},
					{ID=31039,Num=1},
					{ID=82004,Num=9999},
					{ID=89148,Num=100},
				},
		--二档武器降级棒(10个)
		[89154] = {
					{ID=88883,Num=10},
				},
		--二档防具降级棒(10个)
		[89155] = {
					{ID=88884,Num=10},
				},
		--三档武器降级棒(10个)
		[89156] = {
					{ID=88885,Num=10},
				},
		--三档防具降级棒(10个)
		[89157] = {
					{ID=88886,Num=10},
				},
		--四档武降级棒(10个)
		[89158] = {
					{ID=88887,Num=10},
				},
		--四档防具级棒(10个)
		[89159] = {
					{ID=88888,Num=10},
				},
		--勇士礼包（游戏人生）
		[89161] = {
					{ID=31037,Num=1,Bind=3},--红桃皇后卡1
					{ID=80954,Num=5,Bind=3},--宠物品质强化石5
					{ID=82032,Num=2,Bind=3},--VIP防守凭证2个
					{ID=75,Num=2,Bind=3},--时装续时油2个
					{ID=80621,Num=5,Bind=3},--超级VIP卡5个
					{ID=9506,Num=1,Bind=3},--18格背包1个
					},
		--新手礼包
		[89162] = {
					{ID=80397,Num=5,Bind=3},--聊天石5枚
					{ID=31016,Num=1,Bind=3},--恶魔猪宝宝卡-新手宠物卡一张
					{ID=80498,Num=300,Bind=3},--经验兑换券300
					{ID=80696,Num=300,Bind=3},--水晶币兑换卷300
					{ID=202,Num=100,Bind=3},--小型能量药水100
					{ID=102,Num=100,Bind=3},--生命药水100
				},
	    --白金礼包
		[89163] = {
					{ID=80498,Num=800,Bind=3},--经验兑换券800
					{ID=80696,Num=800,Bind=3},--水晶币兑换卷800
					{ID=80397,Num=10,Bind=3},--聊天石10个
					{ID=80274,Num=10,Bind=3},--重生十字章10枚
				},
	    --黄金礼包
		[89164] = {
					{ID={[1]=11318,[2]=11320,Judge = 'Sex'},Num=1,Bind=3},
					{ID={[1]=11319,[2]=11321,Judge = 'Sex'},Num=1,Bind=3},
					{ID=501,Num=10,Bind=3},--小果冻10
					{ID=80397,Num=20,Bind=3},--聊天石20
					{ID=80274,Num=10,Bind=3},--重生十字章10枚
					{ID=82004,Num=500,Bind=3},--超级经验兑换券500
				},
		--嘉年华（2012）大礼包
		[89192] = {
					{ID={[1]=11607,[2]=11605,Judge = 'Sex'},Num=1,Bind=3},
					{ID={[1]=11608,[2]=11606,Judge = 'Sex'},Num=1,Bind=3},
					{ID=31037,Num=1,Bind=3},--嘉年华纪念宠物
					{ID=80397,Num=20,Bind=3},--聊天石x20
					{ID=80274,Num=10,Bind=3},--重生十字章x10
					{ID=75,Num=10,Bind=3},--时装续时油x20
					{ID=9506,Num=1,Bind=3},--18格背包x1
				},
		--圣诞祝福大礼包
		[89202] = {
					{ID={[1]=11621,[2]=11619,Judge = 'Sex'},Num=1,Bind=0},
					{ID={[1]=11622,[2]=11620,Judge = 'Sex'},Num=1,Bind=0},
					},
}

function GoodsPackage_GoodsCallFunc(ActorID,GoodsID,Location,ObjectX,ObjectY,Remove)
	
	ActorID = ActorID or API_RequestGetActorID()
	GoodsID = GoodsID or API_RequestGetNumber(2)
	--API_Trace('开始='..ActorID)
	local Agree = API_RequestGetNumber(1)
	if API_ActorGetGoodsNum(ActorID,GoodsID) < 1 then--判断玩家是否拥有物品
		API_ActorSendMsg(ActorID,3,'没有这个道具')
		return 0
	end
	if GLOBAL_GoodsPackage_GoodsIDList[GoodsID] == nil then--判断物品是否属于道具包裹
		API_ActorSendMsg(ActorID,3,'非法物品')
		
		return 0
	end
	local NeedPoint = GLOBAL_GoodsPackage_GoodsIDList[GoodsID].NeedPoint--需要点券
	local DialogBox = GLOBAL_GoodsPackage_GoodsIDList[GoodsID].DialogBox--需要弹出对话框
	if NeedPoint ~= nil and NeedPoint > 0 and Agree ~= 100 then
		API_ResponseWrite('<name>'..API_GetGoodsName(GoodsID)..'</name>')
		API_ResponseWrite('<text>'..API_GetGoodsName(GoodsID)..'里面有这些的礼物：</text><br>')
		for i in GLOBAL_GoodsPackage_GoodsIDList[GoodsID] do
			if type(GLOBAL_GoodsPackage_GoodsIDList[GoodsID][i]) == 'table' then
				local ExchangeGoodsID = GLOBAL_GoodsPackage_GoodsIDList[GoodsID][i].ID
				local ExchangeGoodsNum = GLOBAL_GoodsPackage_GoodsIDList[GoodsID][i].Num
				if type(ExchangeGoodsID) == 'number' then
					local ExchangeGoodsName = API_GetGoodsName(ExchangeGoodsID)
					API_ResponseWrite('<br><img srcgd="'..ExchangeGoodsID..'" tipgd="'..ExchangeGoodsID..'"><text color="254,249,220"> '..ExchangeGoodsName..'</text><text> × '..ExchangeGoodsNum..' </text>')
				elseif ExchangeGoodsID == 'Title' then
					if TouXianXiTong_TXList[ExchangeGoodsNum] ~= nil then
						local String = TouXianXiTong_TXList[ExchangeGoodsNum].AddFuncName
						if  type(String) == 'string' then
							local Function = _G[String]
							if type(Function) == 'function' then
								local Show,Title,R,G,B,Time,Tip = Function(ActorID,ExchangeGoodsNum)
								API_ResponseWrite('<br><text>头衔：</text><text closewindow="0" color="'..R..','..G..','..B..'">'..Title..'</text>')
							end
						end
					end
				end
			end
		end
		API_ResponseWrite('<br><text>您需要 </text><text color="255,0,255">'..NeedPoint..' 点券</text><text>才能打开它，您确定要打开它吗？</text><br>')
		API_ResponseWrite('<br><a href="GoodsPackage_GoodsCallFunc?1=100&2='..GoodsID..'">立刻花 '..NeedPoint..' 点券打开它</a><br>')
		API_ResponseWrite('<br><a>先不打开，以后再说</a><br>')
		API_ResponseFlush(ActorID)
		return 0
	end
	if NeedPoint ~= nil and NeedPoint > 0 then
		local Point = API_ActorGetPropNum(ActorID,183)
		if Point < NeedPoint then
			API_ActorSendMsg(ActorID,3,'打开'..API_GetGoodsName(GoodsID)..'需要 '..NeedPoint..' 点券，您的点券不够')
			return 0
		end
	end
	if DialogBox ~= nil then
		if DialogBox == 1 then
			API_ResponseWrite('<win rect="250,250,500,220"></win>')
			API_ResponseWrite('<name></name>')
			API_ResponseWrite('<text>亲爱的英雄岛玩家：</text><br>')
			API_ResponseWrite('<text>    火热的夏天来临了！来到英雄岛的你们，现在也能感受到我们如同太阳般的热情。夏日狂欢派对现在正式开始！</text><br>')
			API_ResponseWrite('<text>    所有在此期间登陆的老玩家，都将获得一份属于你们的超值礼包</text><img srcgd="88946" tipgd="88946"><text>，助你一步登天，弥补与以前的兄弟姐妹们的差距！还等什么，赶快体验，与其他好友一同开始夏日狂欢派对吧！</text><br>')
			API_ResponseWrite('<br><a>确定</a>')
			API_ResponseFlush(ActorID)
		elseif DialogBox == 2 then
			API_ResponseWrite('<win rect="250,250,500,220"></win>')
			API_ResponseWrite('<name></name>')
			API_ResponseWrite('<text>亲爱的英雄岛玩家：</text><br>')
			API_ResponseWrite('<text>    火热的夏天来临了！来到英雄岛的你们，现在也能感受到我们如同太阳般的热情。夏日狂欢派对现在正式开始！</text><br>')
			API_ResponseWrite('<text>    所有在此期间登陆的新玩家，都将获得一份属于你们的超值礼包</text><img srcgd="88947" tipgd="88947"><text>，助你轻松上手，玩转英雄岛！还等什么，赶快体验，与全体英雄岛玩家一同开始夏日狂欢派对吧！</text><br>')
			API_ResponseWrite('<br><a>确定</a>')
			API_ResponseFlush(ActorID)
		end
	end
	local NeedPackageSize = 0
	for i in GLOBAL_GoodsPackage_GoodsIDList[GoodsID] do
		if type(GLOBAL_GoodsPackage_GoodsIDList[GoodsID][i]) == 'table' then
			local ExchangeGoodsID = GLOBAL_GoodsPackage_GoodsIDList[GoodsID][i].ID
			if type(ExchangeGoodsID) == 'table' then
				if ExchangeGoodsID.Judge == 'Sex' then
					local Type = API_GetActorSex(ActorID)
					ExchangeGoodsID = ExchangeGoodsID[Type]
				elseif ExchangeGoodsID.Judge == 'Camp' then
					local Type = API_GetActorCamp(ActorID)
					ExchangeGoodsID = ExchangeGoodsID[Type]
				elseif ExchangeGoodsID.Judge == 'Job' then
					local Type = Libao_HeroTypejisuan(ActorID)
					ExchangeGoodsID = ExchangeGoodsID[Type]
				elseif ExchangeGoodsID.Judge == 'Level' then
					local ActorLevel = API_GetActorExpLevel(ActorID)
					local Type = 1
					for i in ExchangeGoodsID.Lv do
						local Lv = ExchangeGoodsID.Lv[i]
						if ActorLevel <= Lv then
							Type = i
							break
						end
					end
					ExchangeGoodsID = ExchangeGoodsID[Type]
				elseif ExchangeGoodsID.Judge == 'rand' then
					local Type = math.random(1,ExchangeGoodsID.value)
					ExchangeGoodsID = ExchangeGoodsID[Type]
				else
					ExchangeGoodsID = 0
				end
			end
			local ExchangeGoodsNum = GLOBAL_GoodsPackage_GoodsIDList[GoodsID][i].Num
			if type(ExchangeGoodsNum) == 'table' then
				if ExchangeGoodsNum.Judge == 'Level' then
					local ActorLevel = API_GetActorExpLevel(ActorID)
					local Type = 1
					for i in ExchangeGoodsNum.Lv do
						local Lv = ExchangeGoodsNum.Lv[i]
						if ActorLevel <= Lv then
							Type = i
							break
						end
					end
					ExchangeGoodsNum = ExchangeGoodsNum[Type]
				else
					ExchangeGoodsNum = 1
				end
			end
			local Bind = GLOBAL_GoodsPackage_GoodsIDList[GoodsID][i].Bind
			if Bind == nil then
				Bind = 0
			end
			if type(ExchangeGoodsID) == 'number' then
				local AddPackageSize = API_ActorCanAddGoods(ActorID,ExchangeGoodsID,ExchangeGoodsNum,Bind,NeedPackageSize)--判断能否向物品栏添加物品
				if AddPackageSize == - 1 then
					NeedPackageSize = AddPackageSize
					break
				else
					NeedPackageSize = NeedPackageSize + AddPackageSize
				end
			end
		end
	end
	if Agree == 100 or NeedPoint == nil or NeedPoint == 0 then
		--API_Trace('333='..Agree)
		if NeedPackageSize ~= -1 then
			local GoodsName = API_GetGoodsName(GoodsID)
			if NeedPoint ~= nil and NeedPoint > 0 then
				if API_UsePoint(ActorID,3,GoodsID,1,NeedPoint) ~= 0 then--判断扣除点券是否成功
					return 0
				else
					API_ActorSendMsg(ActorID,9,'开启'..GoodsName..'扣除'..NeedPoint..'点券')
				end
			end
			if API_ActorRemoveGoods(ActorID,GoodsID,1,'使用'..GoodsName..'') then--销毁玩家身上的物品
				for i in GLOBAL_GoodsPackage_GoodsIDList[GoodsID] do
					if type(GLOBAL_GoodsPackage_GoodsIDList[GoodsID][i]) == 'table' then
						local ExchangeGoodsID = GLOBAL_GoodsPackage_GoodsIDList[GoodsID][i].ID
						if type(ExchangeGoodsID) == 'table' then
							if ExchangeGoodsID.Judge == 'Sex' then
								local Type = API_GetActorSex(ActorID)
								ExchangeGoodsID = ExchangeGoodsID[Type]
							elseif ExchangeGoodsID.Judge == 'Camp' then
								local Type = API_GetActorCamp(ActorID)
								ExchangeGoodsID = ExchangeGoodsID[Type]
							elseif ExchangeGoodsID.Judge == 'Job' then
								local Type = Libao_HeroTypejisuan(ActorID)
								ExchangeGoodsID = ExchangeGoodsID[Type]
							elseif ExchangeGoodsID.Judge == 'Level' then
								local ActorLevel = API_GetActorExpLevel(ActorID)
								local Type = 1
								for i in ExchangeGoodsID.Lv do
									local Lv = ExchangeGoodsID.Lv[i]
									if ActorLevel <= Lv then
										Type = i
										break
									end
								end
								ExchangeGoodsID = ExchangeGoodsID[Type]
							elseif ExchangeGoodsID.Judge == 'rand' then
								local Type = math.random(1,ExchangeGoodsID.value)
								ExchangeGoodsID = ExchangeGoodsID[Type]
							else
								ExchangeGoodsID = 0
							end
						end
						local ExchangeGoodsNum = GLOBAL_GoodsPackage_GoodsIDList[GoodsID][i].Num
						if type(ExchangeGoodsNum) == 'table' then
							if ExchangeGoodsNum.Judge == 'Level' then
								local ActorLevel = API_GetActorExpLevel(ActorID)
								local Type = 1
								for i in ExchangeGoodsNum.Lv do
									local Lv = ExchangeGoodsNum.Lv[i]
									if ActorLevel <= Lv then
										Type = i
										break
									end
								end
								ExchangeGoodsNum = ExchangeGoodsNum[Type]
							else
								ExchangeGoodsNum = 1
							end
						end
						if type(ExchangeGoodsID) == 'number' then
							local ExchangeGoodsName = API_GetGoodsName(ExchangeGoodsID)
							local Bind = GLOBAL_GoodsPackage_GoodsIDList[GoodsID][i].Bind
							if Bind == nil then
								Bind = 0
							end
							local Number = math.random(10000)
							if ExchangeGoodsID == 88065 then
								ShuangBeiJingYan_AddCZK(ActorID)
							elseif ExchangeGoodsID == 76 then
								if GLOBAL_GoodsPackage_GoodsIDList[GoodsID][i].StarLv ~= nil then
									local StarLv = GLOBAL_GoodsPackage_GoodsIDList[GoodsID][i].StarLv
									local UID = API_AddActorGoodsPropRetUID(ActorID, ExchangeGoodsID, ExchangeGoodsNum, Bind, '使用'..GoodsName..'', -1, -1) 
									API_SetUIDPetCapsulePropNum(ActorID, UID, 35, StarLv)
									API_ActorSendMsg(ActorID,10,'您得到 '..ExchangeGoodsName..' X '..ExchangeGoodsNum..'')
								else
									API_AddActorGoodsFlag(ActorID,ExchangeGoodsID,ExchangeGoodsNum,Bind,'使用'..GoodsName..'')
									API_ActorSendMsg(ActorID,10,'您得到 '..ExchangeGoodsName..' X '..ExchangeGoodsNum..'')
								end
							else
								if GLOBAL_GoodsPackage_GoodsIDList[GoodsID][i].Odds ~= nil then
									--API_Trace('得到的物品Odds='..ExchangeGoodsID)
									local GoodsOdds = GLOBAL_GoodsPackage_GoodsIDList[GoodsID][i].Odds
									local Odds
									if type(GoodsOdds) == 'table' then
										Odds = GoodsOdds[ExchangeGoodsID]
									else
										Odds = GoodsOdds
									end
									if Number <= Odds then
										API_AddActorGoodsFlag(ActorID,ExchangeGoodsID,ExchangeGoodsNum,Bind,'使用'..GoodsName..'')
										API_ActorSendMsg(ActorID,10,'您得到 '..ExchangeGoodsName..' X '..ExchangeGoodsNum..'')
										if ExchangeGoodsID == 31032 or ExchangeGoodsID == 31033 then
											local LaiYuan = API_ActorGetPropNum(ActorID,201)
											local Type = 1
											if ExchangeGoodsID == 31032 then
												Type = 1
											elseif ExchangeGoodsID == 31033 then
												Type = 2
											end
											--特殊宠物产出数量
											if GLOBAL_FengXiangBiao_DateList[53][Type][LaiYuan]  == nil then
												GLOBAL_FengXiangBiao_DateList[53][Type][LaiYuan] = 1
											else
												GLOBAL_FengXiangBiao_DateList[53][Type][LaiYuan] = GLOBAL_FengXiangBiao_DateList[53][Type][LaiYuan] + 1
											end
										end
									end
								else
									--API_Trace('得到的物品='..ExchangeGoodsID)
									--if ExchangeGoodsID ~= 11546 or ExchangeGoodsID ~= 11547 then
										API_AddActorGoodsFlag(ActorID,ExchangeGoodsID,ExchangeGoodsNum,Bind,'使用'..GoodsName..'')
										API_ActorSendMsg(ActorID,10,'您得到 '..ExchangeGoodsName..' X '..ExchangeGoodsNum..'')
									--else
									--	API_AddActorGoods(ActorID,ExchangeGoodsID, ExchangeGoodsNum , '使用'..GoodsName..'');
									--	API_ActorSendMsg(ActorID,10,'您得到 '..ExchangeGoodsName..' X '..ExchangeGoodsNum..'')
									--end
								end
							end
						elseif ExchangeGoodsID == 'Title' then
							if TouXianXiTong_TXList[ExchangeGoodsNum] ~= nil then
								QQTeQuan_TouXianAdd(ActorID,ExchangeGoodsNum)
								TouXianXiTong_Title(ActorID,1,ExchangeGoodsNum,1)
								API_ActorSendMsg(ActorID,10,'您得到新的头衔')
							end
						end
					end
				end
			end
		else
			API_ActorSendMsg(ActorID,3,'您的背包空间不足')
			API_ResponseWrite('<name>'..API_GetGoodsName(GoodsID)..'</name>')
			API_ResponseWrite('<br><text>您的背包空间不足，请整理背包，留出更多空间后再来打开'..API_GetGoodsName(GoodsID)..'</text><br>')
			API_ResponseWrite('<br><a>确定</a><br>')
			API_ResponseFlush(ActorID)
			return 0
		end
	end
	return 1
end
