--不同档次装备打造所需时间
GLOBAL_SellItem_Time = {
--装备档次
[1] = {
		--前缀
		Qianzui = {		PSD=1,
					JLD=2,
					PTD=4,
					JGD=6,
					LHD=8,
					JZD=11,
					WMD=14,
					},
		--升级次数
		ShengjiNum = {[0]=0,[1]=1,[2]=2,[3]=3,[4]=5,[5]=7,[6]=9,[7]=12,[8]=17,[9]=25},
		--点化次数
		DianhuaNum = {[0]=0,[1]=2,[2]=4,[3]=6},
		--附加属性个数
		FujiaNum = {[0]=0,[1]=1,[2]=4},
		--宝石插槽个数
		BaoshiNum = {[0]=0,[1]=1,[2]=3,[3]=6},
		--未凿洞宝石插槽个数
		NoBaoshiNum = {[0]=0,[1]=1,[2]=3,[3]=7},
		--卡片插槽个数
		KapianNum = {[0]=0,[1]=2,[2]=5,[3]=0},
		--基数功勋
		Basic = 12,
		--兑换参数
		CanShu = 1,
		--需要活力
		Hunger = 2,
		},
		
		
[2] = {
		Qianzui = {		PSD=1,
					JLD=2,
					PTD=4,
					JGD=6,
					LHD=8,
					JZD=11,
					WMD=14,
					},
		--升级次数
		ShengjiNum = {[0]=0,[1]=1,[2]=2,[3]=3,[4]=5,[5]=7,[6]=9,[7]=12,[8]=17,[9]=25},
		--点化次数
		DianhuaNum = {[0]=0,[1]=2,[2]=4,[3]=6},
		--附加属性个数
		FujiaNum = {[0]=0,[1]=1,[2]=4},
		--宝石插槽个数
		BaoshiNum = {[0]=0,[1]=1,[2]=3,[3]=6},
		--未凿洞宝石插槽个数
		NoBaoshiNum = {[0]=0,[1]=1,[2]=3,[3]=7},
		--卡片插槽个数
		KapianNum = {[0]=0,[1]=2,[2]=5,[3]=0},
		--基数功勋
		Basic = 40,
		--兑换参数
		CanShu = 1,
		--需要活力
		Hunger = 4,
		},
		
		
[3] = {
		Qianzui = {		PSD=1,
					JLD=2,
					PTD=4,
					JGD=6,
					LHD=8,
					JZD=11,
					WMD=14,
					},
		--升级次数
		ShengjiNum = {[0]=0,[1]=1,[2]=2,[3]=3,[4]=5,[5]=7,[6]=9,[7]=12,[8]=17,[9]=25},
		--点化次数
		DianhuaNum = {[0]=0,[1]=2,[2]=4,[3]=6},
		--附加属性个数
		FujiaNum = {[0]=0,[1]=1,[2]=4},
		--宝石插槽个数
		BaoshiNum = {[0]=0,[1]=1,[2]=3,[3]=6},
		--未凿洞宝石插槽个数
		NoBaoshiNum = {[0]=0,[1]=1,[2]=3,[3]=7},
		--卡片插槽个数
		KapianNum = {[0]=0,[1]=2,[2]=5,[3]=0},
		--基数功勋
		Basic = 90,
		--兑换参数
		CanShu = 1,
		--需要活力
		Hunger = 6,
		},
		
		
[4] = {
		Qianzui = {		PSD=1,
					JLD=2,
					PTD=4,
					JGD=6,
					LHD=8,
					JZD=11,
					WMD=14,
					},
		--升级次数
		ShengjiNum = {[0]=0,[1]=1,[2]=2,[3]=3,[4]=5,[5]=7,[6]=9,[7]=12,[8]=17,[9]=25},
		--点化次数
		DianhuaNum = {[0]=0,[1]=2,[2]=4,[3]=6},
		--附加属性个数
		FujiaNum = {[0]=0,[1]=1,[2]=4},
		--宝石插槽个数
		BaoshiNum = {[0]=0,[1]=1,[2]=3,[3]=6},
		--未凿洞宝石插槽个数
		NoBaoshiNum = {[0]=0,[1]=1,[2]=3,[3]=7},
		--卡片插槽个数
		KapianNum = {[0]=0,[1]=2,[2]=5,[3]=0},
		--基数功勋
		Basic = 120,
		--兑换参数
		CanShu = 1,
		--需要活力
		Hunger = 8,
		},
		

[5] = {
		Qianzui = {		PSD=1,
					JLD=2,
					PTD=4,
					JGD=6,
					LHD=8,
					JZD=11,
					WMD=14,
					},
		--升级次数
		ShengjiNum = {[0]=0,[1]=1,[2]=2,[3]=3,[4]=5,[5]=7,[6]=9,[7]=12,[8]=17,[9]=25},
		--点化次数
		DianhuaNum = {[0]=0,[1]=2,[2]=4,[3]=6},
		--附加属性个数
		FujiaNum = {[0]=0,[1]=1,[2]=4},
		--宝石插槽个数
		BaoshiNum = {[0]=0,[1]=1,[2]=3,[3]=6},
		--未凿洞宝石插槽个数
		NoBaoshiNum = {[0]=0,[1]=1,[2]=3,[3]=7},
		--卡片插槽个数
		KapianNum = {[0]=0,[1]=2,[2]=5,[3]=0},
		--基数功勋
		Basic = 150,
		--兑换参数
		CanShu = 1,
		--需要活力
		Hunger = 10,
		},
}